
Object
flights
: 
"Flight Indigo, Ahmedabad to Goa,  price approximately ₹5000, departing 08:00 AM, arriving 09:30 AM.\n\nFlight Air India, Ahmedabad to Goa, price approximately ₹6000, departing 11:00 AM, arriving 12:30 PM.\n\nFlight SpiceJet, Ahmedabad to Goa, price approximately ₹4500, departing 06:00 PM, arriving 07:30 PM.\n\n\n(Note:  These prices and times are approximate and may vary depending on booking time and availability.)\n"
hotel
: 
"The Leela Goa at price $300 with rating 4.5\nThe Lalit Golf & Spa Resort Goa at price $250 with rating 4\nNovotel Goa Dona Sylvia Resort at price $150 with rating 3.5\n\n"
itinerary
: 
"Goa Trip for 4 Travellers: 3-Day Itinerary\n\n**Day 1: North Goa Exploration**\n\nMorning (9:00 AM): Arrive at Goa Airport (GOI) or Madgaon Railway Station (MAO). Check into your pre-booked hotel in North Goa (Calangute, Baga, or similar).  Freshen up.\n\nLate Morning (11:00 AM): Head to Calangute Beach. Relax, swim, or try watersports.\n\nAfternoon (1:00 PM): Enjoy lunch at a beach shack.  Numerous options are available offering fresh seafood and Goan cuisine.\n\nAfternoon (2:30 PM): Explore Baga Beach, known for its vibrant atmosphere and watersports.\n\nLate Afternoon (5:00 PM):  Visit the Aguada Fort, offering panoramic views of the Arabian Sea.\n\nEvening (7:00 PM): Enjoy dinner at a restaurant in Baga or Calangute. Consider trying Goan fish curry rice.\n\nNight (9:00 PM): Relax or enjoy the nightlife in Baga.\n\n\n**Day 2: South Goa Serenity and Spice**\n\nMorning (9:00 AM): Check out from your North Goa hotel. Drive to South Goa (Palolem or Agonda area). Check into your pre-booked hotel.\n\nLate Morning (11:00 AM): Visit Palolem Beach, known for its serene atmosphere and calm waters. Relax on the beach or go for a swim.\n\nAfternoon (1:00 PM): Enjoy lunch at a beach shack in Palolem.\n\nAfternoon (2:30 PM): Visit a spice plantation.  Many offer guided tours and traditional Goan meals.\n\nLate Afternoon (5:00 PM): Explore Patnem Beach, located near Palolem.\n\nEvening (7:00 PM): Enjoy dinner at a restaurant in Palolem or Agonda.\n\nNight (9:00 PM): Relax or enjoy a quiet evening by the beach.\n\n\n**Day 3: Culture and Departure**\n\nMorning (9:00 AM): Visit Old Goa, a UNESCO World Heritage site. Explore the Basilica of Bom Jesus, Se Cathedral, and other historical churches.\n\nLate Morning (11:00 AM): Explore the Church of St. Francis of Assisi and its serene surroundings.\n\nAfternoon (1:00 PM): Enjoy lunch at a restaurant in Old Goa or Panjim.\n\nAfternoon (2:30 PM):  Depending on your flight/train schedule, you can do some souvenir shopping in Panjim city or relax.\n\nEvening (5:00 PM): Transfer to Goa Airport (GOI) or Madgaon Railway Station (MAO) for your departure.\n\n\n**Note:** This is a suggested itinerary, and you can adjust it based on your preferences and interests.  Consider pre-booking accommodations, especially during peak season.  Transportation can be arranged via taxis, rented scooters (for those comfortable driving in Goa), or pre-booked private car services.  Remember to factor in travel time between locations.\n"
[[Prototype]]
: 
Object